OdIfcHostAppServices.brepBuilder(OdBrepBuilder*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,BrepType)
\details
Global setting of B-Rep triangulation.
\details
Global setting of B-Rep triangulation.
\details
Initializes the boundary representation builder with a product-specific implementation.
\param brepBuilder  [out] A reference to an instance of the boundary representation builder class to be initialized.
\param bbType       [in]  A type of boundary representation.
\returns eOk if the B-Rep builder was successfully initialized; otherwise the method returns an appropriate error code.
\remarks
The method returns eNotImplementedYet value by default.

OdIfcHostAppServices.getSubstituteFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdFontType)
\details
Retrieves the current substitute font name. The substitute font is used in cases when a specified font is not found.
\param fontName [in] A font name.
\param fontType [in] A font type.
\returns a string object that contains the substitute font name.
\remarks
The default implementation of this method returns an empty string.
The fontType parameter value must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling

OdIfcHostAppServices.getPreferableFont(OdString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced,OdFontType)
\details
Retrieves the current preferable font name for a specified font name and type.
\param fontName [in] A font name.
\param fontType [in] A font type.
\returns a string object containing the preferable font name.
\remarks
The default implementation of this method returns an empty string.
The fontType parameter value must be one of the following:
Name                    Value    Description
kFontTypeUnknown        0        Unknown.
kFontTypeShx            1        SHX font.
kFontTypeTrueType       2        TrueType font.
kFontTypeShape          3        Shape file.
kFontTypeBig            4        BigFont file.
\sa
Font Handling